###
#   GNU
###

brew "bash-completion@2"
brew "bash"
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "curl"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "grep"
brew "htop"
brew "ipcalc"
brew "iperf"
brew "midnight-commander"
brew "moreutils"
brew "mtr"
brew "ncdu"
brew "nload"
brew "socat"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"


###
#   Modern Tooling
###

brew "eza"
brew "fzf"
brew "gh"
brew "github-markdown-toc"
brew "go-task/tap/go-task"
brew "gum"
brew "jq"
brew "lastpass-cli"
brew "mas"
brew "nvim"
brew "pre-commit"
brew "prometheus"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "starship"
brew "yq"
brew "zoxide"


###
#   Azure
###

brew "azure-cli"
brew "azure/kubelogin/kubelogin"
brew "krew"


###
#   Kubernetes
###

brew "chart-testing"
brew "checkov"
brew "docker"
brew "fluxcd/tap/flux"
brew "helm"
brew "helmfile"
brew "k3d"
brew "k9s"
brew "kubecolor"
brew "kubeconform"
brew "kubectx"
brew "kubernetes-cli"
brew "kyverno"
brew "minikube"
brew "norwoodj/tap/helm-docs"
brew "openshift-cli"
brew "stern"


###
#   Infrastructure
###

brew "ansible"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv"
brew "tflint"


###
#   Programming Languages
###

brew "python"
brew "node"
brew "openjdk"
brew "go"


###
#   Casks
###

cask "bettertouchtool"
cask "drawio"
cask "free-ruler"
cask "iterm2"
cask "keepassxc"
cask "notion"
cask "postman"
cask "vagrant"
cask "visual-studio-code"
cask "vivaldi"
cask "wireshark"
cask "zoom"


###
#   Fonts
###

cask "font-droid-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-roboto-mono-nerd-font"
